{
  "root": {
    "type": "DECISION",
    "content": "Dad: \"Go long Felix!\"\nYou take off running down the field and see the ball racing past you.\n\"I got it, I got it!\"\nYou look down at the puddle of mud beneath you.",
    "decisions": [
      ["Dive for the ball", "b1-1", 1],
      ["Let the ball go", "b1-2", 2]
    ]
  },
  "b1-1": {
    "type": "DECISION",
    "content": "You dive for the ball and land in the mud.\nThe ball lands in front of you, missing your glove.\nDad: \"Oh, so close! Good effort though!\"\nDad: \"Lets head back for dinner, but you better wash before your mom sees you all muddy!\"",
    "decisions": [["Walk back to Dad", "b1-3", 2]]
  },
  "b1-2": {
    "type": "DECISION",
    "content": "You let the ball go and it falls in the mud.\nDad: \"That's alright, you’ll get it next time!\"\nDad: \"It's getting late, let's head back for dinner.\"",
    "decisions": [["Walk back to Dad", "b1-3", 1]]
  },
  "b1-3": {
    "type": "CONTINUE",
    "content": "Dad: \"Great job today Felix, you’re looking ready for this week’s game!\"\n\"I don’t know Papa. I missed almost every catch today...\"\nDad: \"Listen Felix, what's important is that you always try your hardest, even if you think you’ll fail. Now come on, let’s head inside.\"",
    "nextNode": "b1-4"
  },
  "b1-4": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "At the front door, standing there with her hands on her hips is Mom.\nMom: \"Hurry, the food is getting cold! I told you two to come home before it gets dark.\"\nMom: \"I swear it's like anytime I tell you something it goes through one ear and out the other.\"\nMom: \"You need to wake up! Wake up! Wake up!\"",
    "nextNode": "b1-5"
  },
  "b1-5": {
    "type": "DECISION",
    "content": "You open your eyes and see Mom standing at your door.\nMom: \"Wake up Felix and come down for breakfast\"\nMom: \"Remember, it's college day today.\"",
    "decisions": [
      ["Okay im getting up", "b1-6", 0],
      ["5 more minutes", "b1-7", 0]
    ]
  },
  "b1-6": {
    "type": "CONTINUE",
    "content": "Okay, okay. I'm getting up.",
    "nextNode": "b1-8"
  },
  "b1-7": {
    "type": "CONTINUE",
    "content": "\"5 more minutes Mom.\"\nMom: \"Okay, but hurry. You’re going to be late to school.\"",
    "nextNode": "b1-8"
  },
  "b1-8": {
    "type": "DECISION",
    "content": "You get out of bed and step on your 4th place ribbon from last week’s science fair.\n\"How did this get here? Must have fallen from the wall.\"\nStaring at the ribbon you think to yourself what a disappointment that fair was.\n\"Man we had the best project there, we should have at least gotten 2nd place...whatever.\"",
    "decisions": [
      ["Throw away ribbon", "b1-9", 0],
      ["Put ribbon back on wall", "b1-10", 0]
    ]
  },
  "b1-9": {
    "type": "CONTINUE",
    "content": "You throw the ribbon in the trash and get ready for school.",
    "nextNode": "b1-11"
  },
  "b1-10": {
    "type": "CONTINUE",
    "content": "You place the ribbon back on the wall and get ready for school.",
    "nextNode": "b1-11"
  },
  "b1-11": {
    "type": "DECISION",
    "content": "Mom: \"Hurry Felix, you’re going to be late.\"\nYou run downstairs for breakfast and dig into your eggs and toast.\nMom: \"Did you sleep well?\"",
    "decisions": [
      ["Yeah", "b1-12", 0],
      ["Tell her about dream", "b1-13", 0]
    ]
  },
  "b1-12": {
    "type": "CONTINUE",
    "content": "\"Yeah I slept fine. Excited for my last week of high school.\"\nMom: \"I can’t believe you’re already headed off to college!\"",
    "nextNode": "b1-14"
  },
  "b1-13": {
    "type": "CONTINUE",
    "content": "\"I saw Papa again… We were playing catch just like old times.\"\nMom: \"I know you miss him, and things haven’t been easy.\"\nMom: \"But we’ve come so far since then…\"\nMom: \"Now look at you, all grown up and off to college.\"",
    "nextNode": "b1-14"
  },
  "b1-14": {
    "type": "DECISION",
    "content": "Mom: \"You look just like Papa in his Duke t-shirt.\"\nYou quietly look down at your plate.\nMom: \"He would have been so proud of you honey.\"",
    "decisions": [
      ["Thanks", "b1-15", 0],
      ["I hope so", "b1-16", 0]
    ]
  },
  "b1-15": {
    "type": "CONTINUE",
    "content": "\"Thanks Mom. See you after school.\"",
    "nextNode": "b1-17"
  },
  "b1-16": {
    "type": "CONTINUE",
    "content": "\"I sure hope so…\"",
    "nextNode": "b1-17"
  },
  "b1-17": {
    "type": "DECISION",
    "content": "You finish your plate and head to school.",
    "decisions": [["Walk to school", "b1-18", 0]]
  },
  "b1-18": {
    "type": "DECISION",
    "content": "You walk into class and take a seat.\nMr. Davies: \"Alright class, grad practice starts soon so chat amongst yourselves until then.\"\nAlly: \"Hey Felix! Do you want to sign each other’s yearbooks?\n\"Yeah sure.\"\nYou and Ally exchange yearbooks.\nWhat do you write?",
    "decisions": [
      ["HAGS", "b1-19", 0],
      ["Let's stay in touch!", "b1-19", 0],
      ["(Long emotional letter)", "b1-19", 0],
      ["(Leave it blank)", "b1-19", 0]
    ]
  },
  "b1-19": {
    "type": "DECISION",
    "content": "Intercom: \"FELIX HERNANDEZ PLEASE REPORT TO THE PRINCIPAL'S OFFICE IMMEDIATELY.\"\nYour stomach drops.\nAlly: \"Oooo sounds like someones in trouble.\"\n\"Ha ah ha I hope not...\"\nYou exchange back yearbooks and leave class.",
    "decisions": [["Walk to principal’s office", "b1-20", 0]]
  },
  "b1-20": {
    "type": "CONTINUE",
    "content": "You get to the entrance and stop.\n\"What could I possibly be in trouble for?\"\n\"... Oh maybe they found out (something funny and not that bad)\"\n\"Well only one way to find out.\"\nYou open the door and walk in.",
    "nextNode": "b1-21"
  },
  "b1-21": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Principal Khosla: \"Felix, please take a seat. Someone wants to speak with you.\"\nAn older gentleman with a cane walks in.\nOlder Gentleman: \"Greetings Felix. Do you remember me?\"\nYou study his face and he looks vaguely familiar.",
    "decisions": [
      ["No, sorry", "b1-22", 0],
      ["Yes, of course", "b1-23", 0]
    ]
  },
  "b1-22": {
    "type": "CONTINUE",
    "content": "\"Hmm no sorry, I don't think so.\"\nOlder Gentleman: \"Well that's a surprise, I thought you would most certainly remember me.\"",
    "nextNode": "b1-24"
  },
  "b1-23": {
    "type": "CONTINUE",
    "content": "\"Yeah, you’re Chevy Chase right?\"\nOlder Gentleman: \"Huh?\"\n\"Ya the old dude from Community!\"\n\"The show was never the same after you left.\"\nOlder Gentleman: \"What? Oh heavens no you’re mistaken.\"",
    "nextNode": "b1-24"
  },
  "b1-24": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"My name is Mr. Hendricks. I was one of the panelists at the science fair.\"\nYou remember reading about him in an article...\nArthur Hendricks made billions through pharmaceuticals and made headlines by committing himself entirely to philanthropy.\nMr. Hendricks: \"I was mighty impressed with your analysis regarding the varying salinity levels of our vast oceans.\"",
    "decisions": [
      ["Thanks", "b1-25", 0],
      ["Really? We got fourth place.", "b1-26", 0]
    ]
  },
  "b1-25": {
    "type": "CONTINUE",
    "content": "\"Thank you Mr Hendricks, feels good to have our work recognized.\"",
    "nextNode": "b1-27"
  },
  "b1-26": {
    "type": "CONTINUE",
    "content": "\"Really? You’re impressed with a  4th place project?\"\n\"If only the other panelists thought so too.\"Mr Hendricks: \"The other panelists failed to recognize the brilliance behind your methods.\"",
    "nextNode": "b1-27"
  },
  "b1-27": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"For decades I have worked tirelessly to improve the lives of those less fortunate.\"\nMr. Hendricks: \"Now I have began work on my most ambitious feat - Purification of ocean water through desalination methods\"",
    "decisions": [
      ["Sounds interesting", "b1-28", 0],
      ["Why me?", "b1-29", 0]
    ]
  },
  "b1-28": {
    "type": "CONTINUE",
    "content": "\"Sounds interesting, this could help billions of people around the world.\"\nMr. Hendricks: \" I’m glad you realize the great potential of our work Felix.\"",
    "nextNode": "b1-30"
  },
  "b1-29": {
    "type": "CONTINUE",
    "content": "\"That's great and all, but what does this have to do with me?\"",
    "nextNode": "b1-31"
  },
  "b1-30": {
    "type": "DECISION",
    "content": "Mr. Hendricks: \"Your past research and bright mind could be monumental in our efforts.\"\nMr. Hendricks: \"I would love for you to join me in our state of the art research laboratory. This of course would come with a generous salary.\"\nMr. Hendricks: \"How does that sound?\"",
    "decisions": [
      ["Sounds fantastic!", "b1-31", 0],
      ["I don’t know…", "b1-32", 0]
    ]
  },
  "b1-31": {
    "type": "CONTINUE",
    "content": "\"That sounds fantastic! I can’t wait to tell Eddie about our job offers.\"",
    "nextNode": "b1-34"
  },
  "b1-32": {
    "type": "CONTINUE",
    "content": "\"I don’t know...my plan was always to go to college.\"\nMr. Hendricks: \"Listen Felix, what we’re trying to accomplish here will bring real change and have immediate impacts on those who need it the most.\"\n\"Hmm that sounds like a great opportunity. I need some time to think about this though...\"",
    "nextNode": "b1-33"
  },
  "b1-33": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"Felix all I am saying is give us a chance. Work here for 3 months and if it’s not a good fit you can go back to college then. I’ll even pay your whole tuition.\"\n\"Well if that's the case I don’t see why not? Seems like a good opportunity either way.\"\n\"Eddie’s going to be so excited to take this opportunity with me.\"",
    "nextNode": "b1-34"
  },
  "b1-34": {
    "type": "DECISION",
    "content": "Mr. Hendricks: \"Splendid! It pleases me to hear you’ll join us.\"\nMr. Hendricks: \"However, I’m afraid I made myself unclear. This proposal is only for you.\"\n\"Wait what? We worked on that project together!\"",
    "decisions": [
      ["Eddie helped", "b1-35", 0],
      ["It was 50/50 split", "b1-36", 0]
    ]
  },
  "b1-35": {
    "type": "CONTINUE",
    "content": "\"Eddie contributed a lot to the project.\"",
    "nextNode": "b1-37"
  },
  "b1-36": {
    "type": "CONTINUE",
    "content": "\"Eddie did as much work as I did.\"",
    "nextNode": "b1-37"
  },
  "b1-37": {
    "type": "DECISION",
    "content": "Mr. Hendricks: \"Come on now Felix, we both know YOU were the real brains behind the operation.\"\nMr. Hendricks: \"Felix my boy, remember these words. Never allow personal relationships to hinder your true potential. \"",
    "decisions": [
      ["Eddie is smart and capable", "b1-38", 0],
      ["Don’t want to leave Eddie", "b1-39", 0]
    ]
  },
  "b1-38": {
    "type": "CONTINUE",
    "content": "\"You’re wrong! Eddie is a smart and capable mind. I won’t go without him.\"",
    "nextNode": "b1-40"
  },
  "b1-39": {
    "type": "CONTINUE",
    "content": "\"That may be true, but Eddie and I have been through everything together\"\n\"There’s no way I’ll leave without him.\"",
    "nextNode": "b1-40"
  },
  "b1-40": {
    "type": "DECISION",
    "content": "For a moment Mr. Hendricks studies Felix’s eyes.\nYou stare back at him with unwavering conviction.\nMr. Hendricks: \"Well it's clear there's no changing your mind.\"\nMr. Hendricks: \"I guess we can find something he can do.\"",
    "decisions": [
      ["Sounds good I still have to check with my mom", "b1-41", 0],
      ["Perfect, Eddie is going to be so excited!", "b1-42", 0]
    ]
  },
  "b1-41": {
    "type": "CONTINUE",
    "content": "\"Sounds good, I still have to check with my mom.\"",
    "nextNode": "b1-43"
  },
  "b1-42": {
    "type": "CONTINUE",
    "content": "\"Perfect, Eddie is going to be so excited.\"",
    "nextNode": "b1-43"
  },

  "b1-43": {
    "type": "CONTINUE",
    "content": "Mr. Hendricks: \"Great...oh and I forgot to mention - we leave tomorrow at dawn.\"\nMr. Hendricks: \"Worry not, I already made arrangements with your school..\"\nMr. Hendricks: \"Principal Kholsa here has assured me everything will be taken care of.\"\nPrincipal Kholsa gives Mr. Hendricks a slight nod.",
    "nextNode": "b1-44"
  },
  "b1-44": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "The bell rings and it’s now lunch time.\nMr. Hendricks: \"This is goodbye for now Felix, see you tomorrow.\"\n\"Okay sounds good.\"\nYou leave the office and excitedly rush to find Eddie.",
    "decisions": [["Walk to cafeteria", "b1-45", 0]]
  },
  "b1-45": {
    "type": "DECISION",
    "content": "Eddie: \"What’s happening? They said I can go home?\"\n\"You won’t believe what happened\"",
    "decisions": [["Tell Eddie about opportunity", "b1-46", 0]]
  },
  "b1-46": {
    "type": "DECISION",
    "content": "You tell Eddie about the opportunity.\nEddie: \"What?! No way! That’s incredible.\"\nEddie: \"Honestly this sounds better than college anyways, and this way we’ll be able to stick together.\"\nEddie: \"And not to mention the money we’ll make!\"",
    "decisions": [
      ["The money would be nice", "b1-47", 0],
      ["We’re going to learn so much!", "b1-48", 0]
    ]
  },
  "b1-47": {
    "type": "CONTINUE",
    "content": "\"Yeah, the money would be nice I guess..\"\n\"We definitely wouldn’t have the typical ramen experience of a college student haha.\"",
    "nextNode": "b1-49"
  },
  "b1-48": {
    "type": "CONTINUE",
    "content": "\"Yeah! Also think about how much we would learn in this environment.\"\n\"Definitely more than we would ever learn in college!\"",
    "nextNode": "b1-49"
  },
  "b1-49": {
    "type": "DECISION",
    "content": "\"We leave tomorrow, so we better get packing.\"\nEddie: \"This is going to be so fun! \nEddie: \"I can’t wait! I’m going to head home and tell my family.\"\n\"Ok see you tomorrow bright and early!\"",
    "decisions": [["Head home", "b1-50", 0]]
  },
  "b1-50": {
    "type": "DECISION",
    "content": "You walk through the front door.\nMom: \"Oh Felix is it true?! The principal told me all about your opportunity!\"\nMom: \"That’s so exciting!\"\n\"Yeah Mom it’s true. I can’t believe it!\"",
    "decisions": [
      ["I wanted to check with you first", "b1-51", 0],
      ["I’m leaving tomorrow", "b1-52", 0]
    ]
  },
  "b1-51": {
    "type": "CONTINUE",
    "content": "\"I just wanted to check with you first before I leave.\"\n\"This all is happening so fast.\"\nMom: \"Thanks for checking in with me honey.\"\nMom: \"If this is really what you want, I fully support it!\"",
    "nextNode": "b1-53"
  },
  "b1-52": {
    "type": "CONTINUE",
    "content": "\"The plane leaves tomorrow.\"\n\"I know it's sudden but I’m confident it's the right choice for me.\"\nMom: \"Well it seems my little boy is making decisions for himself now!\"",
    "nextNode": "b1-53"
  },
  "b1-53": {
    "type": "DECISION",
    "content": "Mom: \"I know your father always wanted to see you go to his alma mater.\"\nYou look down at your Duke shirt.\nMom: \"But this sounds like an opportunity for you to be a part of a great cause.\"",
    "decisions": [
      ["Going to learn so much", "b1-54", 0],
      ["Going to make real change", "b1-55", 0],
      ["Still want to attend Duke one day", "b1-56", 0]
    ]
  },
  "b1-54": {
    "type": "CONTINUE",
    "content": "\"Yeah, I’m going to learn so much in that environment Mom.\"\n\"Their laboratory sounds incredible!\"",
    "nextNode": "b1-57"
  },
  "b1-55": {
    "type": "CONTINUE",
    "content": "\"It does! I really feel like this will allow me to make a real difference.\"\n\"785 million people lack access to a basic drinking-water service.\"\n\"This includes 144 million people who are just dependent on surface water!\"\n\"Hopefully my work will help those suffering from the water crisis.\"",
    "nextNode": "b1-57"
  },
  "b1-56": {
    "type": "CONTINUE",
    "content": "\"Yeah, and I haven’t forgotten about how important Duke was to Dad.\"\n\"I still want to attend some day.\"",
    "nextNode": "b1-57"
  },
  "b1-57": {
    "type": "CONTINUE",
    "content": "Mom: \"I’m so proud of you Felix. I think this is the right choice for you.\"\nMom: \"Let’s go upstairs and I’ll help you pack.\"\nYou and Mom head upstairs.\nYou go to sleep after dinner.",
    "nextNode": "b1-58"
  },
  "b1-58": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Your 5:30 am alarm rings loudly and instinctively you reach for snooze.\nBut, your excitement shoots you right out of bed.\nMom: \"FEELLLIXX. There’s some car outside waiting for you.\"\nYou quickly get ready and head downstairs.\nMom: \"I’m going to miss you so much Felix. Make sure to call from time to time.\"\n\"Don’t worry I will Mom. You can always come visit.\"\nYou hug your Mom goodbye and head out the door",
    "nextNode": "b1-59"
  },
  "b1-59": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mom: \"Felix wait! You forgot this!\nShe hands you your 4th place ribbon from the science fair.",
    "decisions": [
      ["Thanks Mom", "b1-60", 0],
      ["Keep it in my room", "b1-61", 0]
    ]
  },
  "b1-60": {
    "type": "DECISION",
    "content": "\"Thanks Mom, I’ll put it in my new room.\"\nYou put the ribbon in your backpack.",
    "decisions": [["Walk to car ", "b1-62", 0]]
  },
  "b1-61": {
    "type": "DECISION",
    "content": "\"Thanks Mom, but actually can you keep that in my room.\"",
    "decisions": [["Walk to car ", "b1-62", 0]]
  },
  "b1-62": {
    "type": "CONTINUE",
    "content": "Driver: \"Alright. Mr. Hernandez, we’ve reached our destination.\"\n\"Thanks!\"\nYou step out of the car onto a small airfield.\nMr. Hendricks waves to you standing in front of a small jet.\nMr. Hendricks: \"Felix my boy, come come. Let’s get you settled in.\"\nMr. Hendricks: \"Help yourself to any refreshments… that is if our friend Eddie hasn’t already devoured them aha ha.\"",
    "nextNode": "b1-63"
  },
  "b1-63": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You walk up the stairs into the jet and take a seat.\nEddie: \"Hey Felix! You check out these snacks!? They got every soda you can think of!\"\nEddie: \"And do you see these enormous seats! They go all the way back!\"",
    "decisions": [
      ["It's amazing", "b1-64", 0],
      ["It really is someting else", "b1-65", 0]
    ]
  },
  "b1-64": {
    "type": "CONTINUE",
    "content": "\"This plane is amazing! I can get used to this.\"",
    "nextNode": "b1-66"
  },
  "b1-65": {
    "type": "CONTINUE",
    "content": "\"Uhh you’re right this plane really is something else.\"",
    "nextNode": "b1-66"
  },
  "b1-66": {
    "type": "CONTINUE",
    "content": "Eddie: \"And these chips! Don't even get me started! They’re the crispiest I’ve ever tasted!\"\n\"Eddie I’m pretty sure those are the same chips we get at school.\"\nEddie: \"Really?! I don’t know man, these just taste CRISPIER for some reason.\"\nMr. Hendricks takes a seat in front of you.",
    "nextNode": "b1-67"
  },
  "b1-67": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"As we speak we are headed towards a private Island 76 nautical miles off the coast of Guam.\"\nMr. Hendricks: \"I have given you both a brief overview of our monumental efforts, but it’s time you understood what we are truly trying to accomplish.\"",
    "decisions": [
      ["Wait... an island?", "b1-68", 0],
      ["Eddie, you okay?", "b1-69", 0]
    ]
  },
  "b1-68": {
    "type": "CONTINUE",
    "content": "Wait… did you say an island?",
    "nextNode": "b1-70"
  },
  "b1-69": {
    "type": "CONTINUE",
    "content": "You look over and see Eddie hunched over grabbing his stomach in discomfort.\n\"Hey Eddie, you okay?\"\nEddie: \"Yea I think 9 sodas was one too many...and not to mention my extreme fear of heights.\"\nEddie: \"But wait.. Did Hendricks say something about an island?\"\nMr. Hendricks looks at Eddie and gestures to the flight attendant.",
    "nextNode": "b1-70"
  },
  "b1-70": {
    "type": "DECISION",
    "content": "'Mr. Hendricks: \"Yes. Our laboratory was built on an island. Prime location for our salinity testing using our research vessels.\"",
    "decisions": [
      ["Beaches sound amazing", "b1-71", 0],
      ["Very convenient gathering samples", "b1-72", 0]
    ]
  },
  "b1-71": {
    "type": "CONTINUE",
    "content": "'\"The beaches on the island must be incredible!\"\nMr. Hendricks: \"Aha ha my boy, yes the Island is truly breathtaking...\"\nMr. Hendricks: \"But I hope you take full advantage of our research facilities.",
    "nextNode": "b1-73"
  },
  "b1-72": {
    "type": "CONTINUE",
    "content": "\"That’s awesome! We’ll be able to gather our own test samples.\"\nMr. Hendricks: \"Our research facilities are indeed state of the art…\"\nMr. Hendricks: \"But I hope you also enjoy the unrivaled beauty of the Island.\"",
    "nextNode": "b1-73"
  },
  "b1-73": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks looks out the plane window at the islands beneath us.\nMr. Hendricks: \"It seems like a lifetime ago when I embarked on this mission.\"\nMr. Hendricks: \"33 years ago our company went on a humanitarian trip to an impoverished village.\"\nMr. Hendricks: \"Granted, the trip’s sole purpose was to gain good publicity, but something I saw changed me forever.\"",
    "nextNode": "b1-74"
  },
  "b1-74": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"It wasn’t the absence of electricity, the lack of clean water, or even the poor infrastructure…\"\nMr. Hendricks: \"What changed me was the hope. This notion of hope was never shared explicitly, but rather seen through small moments.\"\nMr. Hendricks: \"Through the laughter of children playing soccer…the sparkle in a mother’s eyes looking at her infant child. These moments were forever ingrained in my mind.\"\nMr. Hendricks: \"But alas, this future they hope for is simply unattainable…\"",
    "decisions": [
      ["Unattainable?", "b1-75", 0],
      ["We can help!", "b1-76", 0]
    ]
  },
  "b1-75": {
    "type": "CONTINUE",
    "content": "\"Unattainable? There has to be something we can do!\"",
    "nextNode": "b1-77"
  },
  "b1-76": {
    "type": "CONTINUE",
    "content": "\"Are you saying the work we do can help?\"",
    "nextNode": "b1-77"
  },
  "b1-77": {
    "type": "CONTINUE",
    "content": "Mr. Hendricks: \"Yes, I plan to help the less fortunate in every way I can. Clean water is just the beginning.\"\nYou look out the window to see a bunch of small islands passing by. \nLooking more closely you see small houses and scattered farms.",
    "nextNode": "b1-78"
  },
  "b1-78": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"I have been aiding the people of this archipelago for decades with basic infrastructure, resources, and whatever else they may need.\"\nMr. Hendricks: \"We have maintained a close relationship with their leadership.\"\nMr. Hendricks: \"Last year, they generously allowed us to conduct our research on one of their many vacant islands.\"\nPilot: \"This is your pilot speaking. We are about to make our final descent.\"\nEveryone gets ready for landing.",
    "nextNode": "b1-79"
  },
  "b1-79": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Pilot: \"Sorry for the rough landing folks. Although it wasn’t my fault... it was the asphalt.\"\nYou turn to see Eddie laughing while still hunched over in pain.\nYou thank the pilot and get off the airplane.\nMr. Hendricks: \"I have to take care of some things. Please follow my assistant Lauren for the tour.\"\nYou and Eddie walk toward Lauren.\nLauren: \"Hi, I’ll be showing you two around I guess. Follow me if you want!\"",
    "decisions": [["Follow Lauren to lab", "b1-79a", 0]]
  },
  "b1-79a": {
    "type": "CONTINUE",
    "content": "You follow Lauren to the entrance of the lab.\nLauren: \"This is the island’s main facility. This is where all our researchers work and stuff.\"\nEveryone walks inside of the facility.\nLauren: \"Welcome to the main lobby. You guys can check out the rest of the facility, or not. Do whatever.\"",
    "nextNode": "b1-80"
  },
  "b1-80": {
    "type": "DECISION",
    "content": "Lauren stands to the corner of the room on her phone.\n(Visit all locations and talk to everyone to end tour)",
    "decisions": [
      ["Go to cafeteria", "b1-81", 0],
      ["Go to research lab", "b1-82", 0],
      ["Go to break room", "b1-83", 0]
    ],
    "hiddenButton": ["End tour", "b1-95", 0]
  },
  "b1-81": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You enter the cafeteria and notice the place to be mostly empty.\nYou see an older lady with a large sun hat sitting at the patio.",
    "decisions": [
      ["Talk to the lady", "b1-84", 0],
      ["Ask Lauren about room", "b1-85", 0],
      ["Head back to lobby", "b1-86", 0]
    ]
  },
  "b1-84": {
    "type": "DECISION",
    "content": "You approach the woman and she glances back at you.\nLady: \"Hello, are you new? I haven’t seen you around.\"\n\"Hi, I’m Felix. I just got to the island a few minutes ago.\"\nLady: \"Oh my husband hasn’t mentioned you. I’m Mrs. Hendricks. Pleasure.\"\nYou shake her hand.\nMrs. Hendricks: \"Let me know if you have any questions.\"",
    "decisions": [
      ["How's the food?", "b1-87", 0],
      ["What do you do around here?", "b1-88", 0]
    ]
  },
  "b1-87": {
    "type": "DECISION",
    "content": "\"How’s the food here?\"\nMrs. Hendricks: \"Satisfactory, although not quite up to my standards.\"\n\"Good thing I'm not picky!\"\n\"As long as there’s hot sauce lying around, I’m good to go.\"\nMrs. Hendricks: \"Ah I see...hot sauce...that will certainly SPICE things up!\"\nMrs. Hendricks clears her throat and checks the time\nMrs. Hendricks: \"Well if you’ll excuse me, I must bid you farewell. I’m sure we’ll meet again.\"",
    "decisions": [["Head back to cafeteria", "b1-89", 0]]
  },
  "b1-89": {
    "type": "CONTINUE",
    "content": "You head back to the cafeteria",
    "nextNode": "b1-81"
  },
  "b1-88": {
    "type": "DECISION",
    "content": "\"What do you do around here?\"\nMrs. Hendricks: \"Well a variety of things really. At times I assist my husband with basic operations, but I mostly focus on writing my novel.\"\n\"Woah you’re an author? That’s super cool. What are you writing about?\"\nMrs. Hendricks: \"A tale of discovery and righteousness.\"\nYou smile and nod your head pretending to know what that means.\nMrs. Hendricks: \"I must be on my way now Felix dear, this novel will not write itself!\"\n\"Of course, it was nice to meet you!\"",
    "decisions": [["Head back to cafeteria", "b1-89", 0]]
  },
  "b1-85": {
    "type": "CONTINUE",
    "content": "\"Hey Lauren can you tell me about the cafeteria.\"\nLauren: \"The cafeteria? People eat here. That’s about it.\"\n\"Do they serve lasagna?\"\nLauren: \"I don’t know, check the menu.\"\n\"I hate lasagna.\"\nLauren: \"Umm okay. Thanks for sharing.\"\nYou walk away.",
    "nextNode": "b1-81"
  },
  "b1-86": {
    "type": "CONTINUE",
    "content": "You head back to the lobby.",
    "nextNode": "b1-80"
  },
  "b1-82": {
    "type": "DECISION",
    "content": "You walk down the hall to find a large room labeled \"Research Lab.\"\n\"Oh this looks cool.\"\nYou open the door and walk in. You look in awe at the state of the art equipment.\nResearcher: \"Hey, what are you doing around here? Are you lost?\"\n\"Oh. Hi, I’m Felix. I just got to the island. I’m just checking the lab out.\"\nResearcher: \"The name’s Ryan. Dr. Jacobs to you. You must be one of the new interns.\"\nDr. Jacobs: \"I’m glad you’re kid, we got some vials that need a good scrubbing.\"\nDr. Jacobs: \"Put some elbow grease into it, you don’t want to end up like the last guy...\"",
    "decisions": [
      ["I'm not cleaning vials!", "b1-90", 0],
      ["Sorry, I'm not an intern", "b1-91", 0]
    ]
  },
  "b1-90": {
    "type": "DECISION",
    "content": "\"I didn’t come here to clean vials!\"\n\"Mr. Hendricks brought me here to conduct research on ocean salinity levels.\"\nDr. Jacobs: \"Looks like we’ve got a real hot shot over here! Isn’t that just dandy.\"\nDr. Jacobs: \"Now get lost kid, you still can’t be here. This is a private lab.\"\nYou exit the lab.",
    "decisions": [["Head back to lobby", "b1-86", 0]]
  },
  "b1-91": {
    "type": "DECISION",
    "content": "\"Sorry but I think you’re mistaken, I’m not an intern. I just started here as a full time researcher.\"\nDr. Jacobs: \"Oh is that so? Well well pardon my ignorance. How dare I mistake a prodigy like yourself for a measly intern!\"\nDr. Jacobs: \"However distinguished you may be, this is still a private lab. I trust you’re smart enough to find the door.\"\nYou leave the lab.",
    "decisions": [["Head back to lobby", "b1-86", 0]]
  },
  "b1-83": {
    "type": "DECISION",
    "content": "You enter the break room to see modern style couches, fun chairs, foosball table, and a mini bar with snacks and refreshments.\nAt one of the TVs is a girl about your age playing video games.",
    "decisions": [
      ["Talk to the girl", "b1-92", 0],
      ["Eat some snacks", "b1-93", 0],
      ["Ask Lauren about room", "b1-94", 0],
      ["Head back to the lobby", "b1-86", 0]
    ]
  },
  "b1-92": {
    "type": "CONTINUE",
    "content": "While walking towards her you trip on one of the wires and disconnect the gaming console.\nGirl: \"HEY WHAT'S YOUR PROBLEM!? I just lost because of you!\"\n\"Oh I’m so sorry I didn’t see the wire there. Here let me reconnect it\"\nGirl: \"It’s too late for that {INSERT LEGENDARY NICKNAME}!\"\nShe storms out of the room.",
    "nextNode": "b1-83"
  },
  "b1-93": {
    "type": "CONTINUE",
    "content": "You walk to the snack bar and see the last chocolate bar calling your name\nYou grab it and scarf it down.",
    "nextNode": "b1-83"
  },
  "b1-94": {
    "type": "CONTINUE",
    "content": "\"Hey Lauren what’s this room?\"\nLauren: \"As you can see, this is a break room. People take breaks here.\"\nLauren: \"Any other good questions?\"\n\"I guess not…\"",
    "nextNode": "b1-83"
  },
  "b1-95": {
    "type": "CONTINUE",
    "content": "You walk up to Lauren.\n\"Okay, I think we mostly checked out everything.\"",
    "nextNode": "b1-96"
  },
  "b1-96": {
    "type": "DECISION",
    "content": "Lauren: \"By the way, don’t forget to get dressed for tonight’s quarterly banquet, everyone’s going to be there.\"\nYou and Eddie nervously look at each other, as none of you have suits.\nLauren: \"How professional... I’ll have some here ready for you.\"",
    "decisions": [
      ["Bungalows?", "b1-97", 0],
      ["Thanks", "b1-98", 0]
    ]
  },
  "b1-97": {
    "type": "CONTINUE",
    "content": "\"We have bungalows?\"\nLauren: \"Oh, did no one tell you guys? You two will be living in the two vacant bungalows near the coast.\"\nLauren: \"Surely, beats my tiny apartment down in employee housing… Don’t know how you two ended up with that.\"\nEddie: \"That’s so cool! Let’s check it out.\"",
    "nextNode": "b1-99"
  },
  "b1-98": {
    "type": "CONTINUE",
    "content": "\"Thanks, you're a lifesaver.\"\nEddie: \"Dope! Oh! Oh! Can you give me an old fashioned white suit like in the Godfather?!\"\nLauren: \"Sorry Eddie, no way that’s happening. You’re getting a normal suit.\"\nEddie: \"You know what, I’d like to speak with your manager.\"",
    "nextNode": "b1-99"
  },
  "b1-99": {
    "type": "CONTINUE",
    "content": "Lauren: \"You guys don’t have time for that right now. The banquet is in 10 minutes. Hurry up and get changed.\"\nLauren hands you both suits.\nEddie: \"I call the gray suit!\"\nEddie takes the gray suit and runs off.\nYou grab the navy blue one and go change.",
    "nextNode": "b1-100"
  },
  "b1-100": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You and Eddie walk out in the suits.\nEddie: \"Damn Felix… Looking good my dude.\"\nFelix: \"Me? Look at you Mr. Fresh.\"\nEddie hits a runway pose.\nLauren: \"I’ll admit you guys clean up well, but we don’t have all day. Let’s get a move on boys.\"",
    "decisions": [["Walk to main hall", "b1-101", 0]]
  },
  "b1-101": {
    "type": "DECISION",
    "content": "You walk into the main hall to find a sea of fancy dressed people and tables.\nThe sound of small talk and laughter floods the room.\nEddie: \"Ok Felix, I’ll see you on the other side. It’s time to mingle.\"\nYou see Eddie go ahead and get lost in the crowd.\nYou turn to Lauren with a nervous look.\nLauren: \"Why are you looking at me? Go be social.\"\nYou walk forward into the crowd.",
    "decisions": [
      ["Walk to the right", "b1-102", 0],
      ["Walk to the left", "b1-103", 0]
    ]
  },
  "b1-102": {
    "type": "CONTINUE",
    "content": "You walk to the right and a man suddenly grabs your shoulder.\n\tMan: \"Hey do you know if they are serving pizza tonight?\"\n\t\"Uhh I don’t know… probably not.\"\n\tMan: \"Good… I hate pizza!\"\n\tThe man walks away in a hurry.",
    "nextNode": "b1-104"
  },
  "b1-103": {
    "type": "CONTINUE",
    "content": "You walk to the left and overhear Eddie talking to a group of people.\n\tEddie: \"And then I was like... a baby? I don't even know how to spell.\"\n\tThe group of people erupt in laughter.",
    "nextNode": "b1-104"
  },
  "b1-104": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You find your table and sit next to an older looking gentleman.\n\"Hi, I’m Felix. One of the new employees.\"\nMr. Brightwater: \"Pleasure to meet you Felix. My name is Mr. Brightwater. I run the purification testing group.\"\n(Ask both questions to continue.)",
    "decisions": [
      ["Ask him about job", "b1-105", 0],
      ["Ask him about Mr. Hendricks", "b1-106", 0]
    ],
    "hiddenButton": ["End conversation", "b1-107", 0]
  },
  "b1-105": {
    "type": "CONTINUE",
    "content": "\"How’s working on purification testing? Do you guys go out in the ocean for testing?\"\nMr. Brightwater: \"Yes, in fact we do. Every wednesday we go out on the research boat. It’s like a mini vacation for our group haha.\"\n\"That sounds so fun!\"\nMr. Brightwater: \"It sure is! You sure come with us one of these days.\"",
    "nextNode": "b1-104"
  },
  "b1-106": {
    "type": "CONTINUE",
    "content": "\"So what’s Mr. Hendricks like?\"\nMr. Brightwater: \"Well I haven’t been around him much, but I’ve heard good things about him.\"\nMr. Brightwater: \"Mr. Hendricks mostly keeps to himself, he is a very driven and busy man.\"\n\"Yeah I can imagine, but I hope I get to know him better!\"\nMr. Brightwater: \"I wouldn’t count on it…\"",
    "nextNode": "b1-104"
  },
  "b1-107": {
    "type": "CONTINUE",
    "content": "Everyone goes silent, as Mr. Hendricks takes the stage.\nMr. Hendricks: \"Welcome ladies and gentlemen! It is a pleasure to be hosting this wonderful banquet once again!\"\nMr. Hendricks: \"Before me I see the brightest minds, the most driven individuals, and the most kind-hearted people I’ve met!\"\nMr. Hendricks: \"We’ve all worked tirelessly towards achieving this noble mission, and I am truly proud of the progress we’ve made.\"",
    "nextNode": "b1-108"
  },
  "b1-108": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"Never lose sight of why we do what we do. There are people out there whose lives we could truly improve, and THAT’S our mission, to help those who need it the most.\"\nMr. Hendricks: \"Lastly, It is my pleasure to introduce the newest additions to our team - Felix Hernandez and Edward Zhao.\"\nMr. Hendricks: \"Enjoy yourselves and have a splendid night!\"\nThe crowd applauses.",
    "nextNode": "b1-109"
  },
  "b1-109": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Brightwater: \"What a speech. The man always knows what to say.\"\nAcross the table, you hear a loud shatter.\nWoman: \"ITS RUINED! How dare you! This dress costs more than what you make in a year!\"\nWaiter: \"I’m so sorry ma’am, I’ll get that cleaned up right away.\"\nThe waiter leaves in a hurry to help the woman.\nWoman: \"It’s so hard to find good help these days...\"",
    "decisions": [
      ["Agree with her", "b1-110", 0],
      ["Defend the waiter", "b1-111", 0]
    ]
  },
  "b1-110": {
    "type": "CONTINUE",
    "content": "\"I’m so sorry ma’am, can I offer you a napkin?\nYou hand the woman a napkin.\nWoman: \"Thank you. Glad there’s someone here that has good manners.\" \n\"No problem. You’d think carrying a few plates would be a simple task...\"\nWoman: \"Precisely. Now I must get this cleaned up.\"\nThe woman leaves.\nMr. Brightwater: \"Smart of you to get on her good side. That woman is Mrs. Higgins, one of the most generous donors of this operation.\"",
    "nextNode": "b1-114"
  },
  "b1-111": {
    "type": "DECISION",
    "content": "\"Excuse me ma’am, but I saw what happened...it was clearly an accident.\"\nWoman: \"Well don’t you have a smart mouth. Do you know who I am, child?!\"\nWoman: \"I am Mrs. Higgins, one of the most generous donors of this operation.\"\nWoman: \"So, I highly advise you to apologize for your rude remarks.\"",
    "decisions": [
      ["Apologize", "b1-112", 0],
      ["Don’t Apologize", "b1-113", 0]
    ]
  },
  "b1-112": {
    "type": "CONTINUE",
    "content": "\"I’m so sorry Mrs. Higgins for speaking out of line. I had no idea who you were.\"\nMrs. Higgins: \"Apology accepted. I hope you watch that mouth going forward. It could get you in a heap of trouble.\"\nMrs. Higgins leaves.",
    "nextNode": "b1-114"
  },
  "b1-113": {
    "type": "CONTINUE",
    "content": "\"It’s nice to meet you Mrs. Higgins, but I don’t think I need to apologize.\"\nMrs. Higgins: \"Good heavens! Aren't you a stubborn one! I’ll be sure to remember YOU.\"\nShe storms off.",
    "nextNode": "b1-114"
  },
  "b1-114": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "After a few hours of mandatory socializing, you leave to your bungalow.\nAs you exit the main hall, you notice the waiter from earlier taking the trash out.\n\"Hey aren’t you the waiter from earlier.\"\nWaiter: \"Yeah, sorry the accident earlier.\"",
    "decisions": [
      ["Accidents happen", "b1-115", 0],
      ["Does that happen often?", "b1-116", 0]
    ]
  },
  "b1-115": {
    "type": "DECISION",
    "content": "\"It’s okay, accidents happen man. That lady was pretty rude though.\"\nWaiter: \"Yeah. Mrs. Higgins isn’t the biggest fan of me.\"\n\"Haha.. Ya I could tell. My name’s Felix by the way.\"\nToka: \"Good to meet you, I’m Toka. You know you’re the first employee to ask for my name.\"\nToka: \"I have to get back to work, but I’ll see you around.\"\n\"Nice to meet you. See you later.\"\nYou walk to your bungalow.",
    "decisions": [["Walk to your bungalow", "b1-117", 0]]
  },
  "b1-116": {
    "type": "DECISION",
    "content": "\"So, does that happen often? Or was that a one time thing?\"\nWaiter: \"It rarely happens, but for a huge event like tonight it’s hard to stay perfect.\"\n\"Ah I feel you, your job definitely looks like it could be difficult sometimes.\"\nWaiter: \"I know! Everyone thinks being a waiter is the easiest job around, but it isn’t!\"\n\"Anyways, I’m Felix, what’s your name?\"\nToka: \"Nice to meet you Felix, I’m Toka.\n\"Alright Toka, you have a good night.\"\nYou walk to your bungalow.",
    "decisions": [["Walk to your bungalow", "b1-117", 0]]
  },
  "b1-117": {
    "type": "CONTINUE",
    "content": "You get to your bungalow and take a shower.\nExhausted, you head to bed.\nJust as you get comfortable under the sheets, you hear ... .\nYou look out the window to see tree branches being flung by strong winds.\n\"It was probably just the wind.\"\nYou get back into bed.",
    "nextNode": "b1-118"
  },
  "b1-118": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Suddenly, you hear repeated tapping coming from outside.\nThe noise slowly fades away.",
    "decisions": [
      ["Hide under your covers.", "b1-119", 0],
      ["Check it out", "b1-120", 0]
    ]
  },
  "b1-119": {
    "type": "CONTINUE",
    "content": "You’re beyond spooked and decide the only safe place is under the covers.\n\"Maybe If I sleep it’ll go away…\"",
    "nextNode": "b1-123"
  },
  "b1-120": {
    "type": "DECISION",
    "content": "You get up and open the door.\nYou look out and see a shadow scurry off into the distance.",
    "decisions": [
      ["Go outside to investigate", "b1-121", 0],
      ["Head back inside", "b1-122", 0]
    ]
  },
  "b1-121": {
    "type": "DECISION",
    "content": "You run after the shadowy figure, but it has vanished.\nYou look around and nothing is out of the ordinary.\nThe crashing of waves and constant howling of the wind mask all other sounds.\nThe scenery is almost pleasant.",
    "decisions": [["Head back inside", "b1-122", 0]]
  },
  "b1-122": {
    "type": "CONTINUE",
    "content": "Confused and slightly concerned, you head back to bed.\nRight when you take a step, you see a small note on the floor.\nIt reads \"GET OUT\" with bright red ink.\nYour hand shakes uncontrollably as you reach for the note.\nYou can’t believe this is happening.\nThousands of questions rush into your mind.\nWho did this? Why? On my first day?\nYou lay down on your bed, eyes wide open.",
    "nextNode": "b1-129"
  },
  "b1-123": {
    "type": "DECISION",
    "content": "You wake up and look around in a daze.\nYou get up and look outside, still startled from last night.\nYou open the door and a cool sea breeze gently flows by.\nIt’s a beautiful sunny day with no clouds in the sky.",
    "decisions": [
      ["Admire the scenery", "b1-124", 0],
      ["Head back inside", "b1-125", 0]
    ]
  },
  "b1-124": {
    "type": "CONTINUE",
    "content": "\"Wow, that's some good scenery!\"\nYou head back inside.",
    "nextNode": "b1-126"
  },
  "b1-125": {
    "type": "CONTINUE",
    "content": "You head back inside.",
    "nextNode": "b1-126"
  },
  "b1-126": {
    "type": "DECISION",
    "content": "You step on a piece of paper and look down.\nIt reads \"GET OUT\" with bright red ink.\nYour stomach drops.\n\"Who could possibly not want me here?\"\nYou pick up the note.",
    "decisions": [
      ["Crumble it and put it in drawer", "b1-127", 0],
      ["Put it in bag", "b1-128", 0]
    ]
  },
  "b1-127": {
    "type": "DECISION",
    "content": "\"I can’t think about this right now, I have to go to work.\"\nYou crumble the note up and put it in your drawer.\nYou get ready for your first day.",
    "decisions": [["Walk to the lab", "b1-130", 0]]
  },
  "b1-128": {
    "type": "DECISION",
    "content": "Your alarm goes off.\n\"I’m going to be late!\"\nYou quickly put the note in your bag and get ready for your first day.",
    "decisions": [["Walk to the lab", "b1-130", 0]]
  },
  "b1-129": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You wake up groggy, barely getting any sleep.\nYour eyes immediately focus on the note from last night.\nThe alarm goes off.\nYou pick it up and quickly shove it into your bag.\nYou get dressed and head for your first day.",
    "decisions": [["Walk to the lab", "b1-130", 0]]
  },
  "b1-130": {
    "type": "DECISION",
    "content": "You rush into the lobby of the lab and see Eddie laying on one of the sofas.\nEddie: \"Oh hey Felix, what took you so long?\"\n\"Hey, I’m alright...didn’t get much sleep.\"\nEddie: \"Really? I slept like a baby! Is your bed not comfortable or something?\"",
    "decisions": [
      ["Everythings fine", "b1-131", 0],
      ["I got a note…", "b1-132", 0]
    ]
  },
  "b1-131": {
    "type": "CONTINUE",
    "content": "\"Everythings fine, I’m just not used to the new bed yet.\"\nEddie: \"You always were the more delicate one.\"\nYou roll your eyes\n\"Yeah I guess you’re right about that.\"",
    "nextNode": "b1-133"
  },
  "b1-132": {
    "type": "CONTINUE",
    "content": "\"I got a note last night…\"\nEddie: \"Oh cool, I got a welcome note too. It also came with some chocolates and stuff.\"\n\"No Eddie. Someone sent me this note in the middle of the night. It read GET OUT in red ink.\"\nEddie: \"What… wait… you think it was written in like blood?\"\n\"Umm no, pretty sure just a red marker.\"\nEddie: \"Oh ok. It was probably just someone hazing the new guys. But if it was blood then probably you got yourself a serious situation buddy.\"\nEddie: \"Nobody’s going to use blood for a harmless prank, but murderers...yeah they definitely use blood.\"",
    "nextNode": "b1-133"
  },
  "b1-133": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Dr. Jacobs turns the corner approaching you.\nDr. Jacobs: \"Just your luck kid, looks like you’re with me. Let’s go.\"\nYou forge a smile and say bye to Eddie\nDr. Jacobs begins to walk through the hall. You follow.\nDr. Jacobs: \"Aw man I really hate having to get the newbies.\"",
    "decisions": [["Walk to research lab", "b1-134", 0]]
  },
  "b1-134": {
    "type": "DECISION",
    "content": "You and Dr. Jacobs enter the lab to see the rest of the team sitting around a table\nDr. Jacobs: \"Alright folks I brought us the latest newbie! Freddy, introduce yourself to the team.\"",
    "decisions": [
      ["Introduce yourself (Confrontational)", "b1-135", 0],
      ["Introduce yourself (Nice)", "b1-136", 0]
    ]
  },
  "b1-135": {
    "type": "CONTINUE",
    "content": "\"Thanks Dr. Jackie for the warm welcome. My name is Felix and I’m excited to be working with you all.\"\nDr. Jacobs gives you a snarky look.",
    "nextNode": "b1-137"
  },
  "b1-136": {
    "type": "CONTINUE",
    "content": "\"Hi everyone my name is Felix. I look forward to working with you all.\"",
    "nextNode": "b1-137"
  },
  "b1-137": {
    "type": "DECISION",
    "content": "Laura: \"Hi Felix. I’m Dr. Stevens, but you can call me Laura.\"\n\"Hi, pleasure to meet you.\"\nYou look at the last team member in the corner, and recognize her from the break room.\nAva: \"Hey Felix, we’ve already met… You remember right? In the break room where you ruined my game. My name’s Ava.\"",
    "decisions": [
      ["Apologize", "b1-138", 0],
      ["Funny comment", "b1-139", 0]
    ]
  },
  "b1-138": {
    "type": "CONTINUE",
    "content": "\"Oh I’m so sorry about that. It was an accident.\"\nAva: \"I STILL don’t know how you didn’t see the wire...but it’s fine I guess.\"",
    "nextNode": "b1-140"
  },
  "b1-139": {
    "type": "CONTINUE",
    "content": "\"Yeah.. I remember. I really did you a favor tho. Let’s be honest you weren’t about to get that high score anyway.\"\nAva: \"WOW. The nerve on some people. I see how it is.\"",
    "nextNode": "b1-140"
  },
  "b1-140": {
    "type": "CONTINUE",
    "content": "Dr. Jacobs: \"Alright guys, enough chit-chat it’s time to get to work!\"\nDr. Jacobs: \"Ava can you please get Felix caught up on what we are working on.\"\nAva: \"Sure.\"\nFor the next few hours you work in the lab.",
    "nextNode": "b1-141"
  },
  "b1-141": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Ava: \"Okay, so basically if we pour this solution we can see the salinity levels in the water.\"\nWhile Ava explains you start to look around and check out the other equipment.\nYou can’t believe this expensive equipment is all around you and you can actually use it.\nAva snaps her fingers.\nAva: \"Hey!\" Are you even listening to me? You better pay attention, one wrong move and you could ruin our entire sample.\"\n\"I’m sure it's not that difficult, all you’re doing is pouring solution from one vial...\"",
    "decisions": [
      ["Pour the solution", "b1-142", 0],
      ["Put vial down", "b1-146", 0]
    ]
  },
  "b1-142": {
    "type": "CONTINUE",
    "content": "You pour the solution from one vial to the other. The solution begins to foam up and rise.\nAva: \"Felix! What did you do?! That wasn’t the right vial!\"\n\"Oh shoot what do I do?!\"",
    "nextNode": "b1-143"
  },
  "b1-143": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "CLICK, CLACK, CLICK\nMr. Hendricks’ cane hits the floor with every step.\nEveryone’s heads turn toward the door.\nDr. Jacobs: \"Look alive people! Mr. Bossman is here!\"\nAva quickly grabs the sample and hides it behind her back.",
    "nextNode": "b1-144"
  },
  "b1-144": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"Oh no need for the formality, everyone proceed with your work.\"\nMr. Hendricks: \"I just came to have a quick chat with our Felix is all.\"\nYou walk away from Ava to bring the attention away from the mess.\nMr. Hendricks: \"Felix my boy! How are you settled in?\"\n\"Hey Mr. Hendricks, everything’s great. Ava was just showing me around the lab.\"\nMr. Hendricks looks over at Ava with a smile as she nervously smiles back, hands behind her back.",
    "nextNode": "b1-145"
  },
  "b1-145": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"Wonderful to hear! Well, I better let you get back to work.\"\nMr. Hendricks: \"Keep working hard Felix. I got big plans for you. BIG.\"\n\"Okay. See you. Thanks for stopping by.\"",
    "nextNode": "b1-151"
  },
  "b1-146": {
    "type": "CONTINUE",
    "content": "You carefully put the vial down.\nAva: \"Ok Mr. Cocky, I bet you didn’t know that was the wrong solution...you were about to ruin the sample!\"\n\"You’re lying, I doubt that.\"\nAva: \"This is the right solution. Use this one in the water sample.\"\nAva reaches out to hand you the water sample.\nAs you reach for it, she accidentally lets go too early and…\nCRACK!\nThe vial smashes the floor and shatters into a million pieces.",
    "nextNode": "b1-147"
  },
  "b1-147": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "You both freeze and look at each other wide-eyed\nAva: \"Oh my god Felix! I thought you were holding it!\"\n\"No, you let go of it too early!\"\nAva: \"Oh no...\"\nYou see everyone’s heads turn toward the door.\nDr. Jacobs: \"Look alive people! The big man has entered the building!\"",
    "nextNode": "b1-148"
  },
  "b1-148": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "CLICK, CLACK, CLICK\nMr. Hendricks’ cane hits the floor with every step.\nHis eyes lock with yours and he walks forward. \nAva quickly stands in front of the shattered sample.\nMr. Hendricks: \"Felix my boy, how’s your first day treating you?\"",
    "decisions": [
      ["Good", "b1-149", 0],
      ["Could be better", "b1-150", 0]
    ]
  },
  "b1-149": {
    "type": "CONTINUE",
    "content": "You turn and walk toward Mr. Hendricks, moving away from the accident.\n\"Uhhh. ya… Pretty good, can’t really complain. The lab sounds really interesting.\"\nMr. Hendricks: \"Ahaha. Work hard Felix, and I have no doubt you will progress here.\"\nMr. Hendricks: \"Well don’t let me stop you from working, just came here to check on you is all.\"",
    "nextNode": "b1-151"
  },
  "b1-150": {
    "type": "CONTINUE",
    "content": "You turn and walk toward Mr. Hendricks, moving away from the accident.\n\"Everything’s been great, I’m just a little overwhelmed with how much cool stuff there is here.\"\nMr. Henricks: \"Ah yes, the state of the art equipment we have here is enough to make any child giddy!\"\nMr. Hendricks: \"Just make sure not to break anything...they cost a fortune!\"\nYour eyes dart around nervously. Your skin feels hot.\nMr. Hendricks: \"Ahaha just kidding my boy, I know you’ll do great!\"",
    "nextNode": "b1-151"
  },
  "b1-151": {
    "type": "CONTINUE",
    "content": "Mr. Hendricks leaves the lab.\nThe sound of his cane echoes off into the hallway.\nAva: \"That was weird...in all of my time here, Mr. Hendricks has never come into the lab.\"\nAva: \"Now that i think about it, I’ve never even talked with him.\"\n\"Huh? That is weird...\"",
    "nextNode": "b1-152"
  },
  "b1-152": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "\"Anyways, what are we going to do about this mess?\"\nAva looks at the broken beaker containing the water sample.\nAva: \"Well the sample is ruined, so I’ll have to tell Dr. Jacobs.\"\nAva: \"He is not going to be happy. The last time someone ruined a sample, he created a powerpoint presentation about how incompetent they were.\"\n\"Oh, he sounds fun to work with.\"",
    "decisions": [
      ["How important is the sample?", "b1-153", 0],
      ["Do we have to tell Dr. Jacobs?", "b1-154", 0]
    ]
  },
  "b1-153": {
    "type": "CONTINUE",
    "content": "\"How important is the sample?\nAva: \"Pretty important Felix. All our research is about the salinity levels in the water.\"\n\"Okay, fine then. Let’s just get these samples ourselves. It’s just water…\"\nAva: \"Just water? No, this water was collected 168 nautical miles from our shore. It’s too far.\"",
    "nextNode": "b1-155"
  },
  "b1-154": {
    "type": "CONTINUE",
    "content": "\"Do we really have to tell him though?\"\nAva: \"Yes! We have to! He’ll find out one way or the other.\"\nAva: \"That man is a hawk when it comes to keeping tabs on our work.\"\n\"Hm ok fine. But what if we found a way to fix this...\"\nAva: \"What do you mean?\"\n\"Well, what if we just got the sample ourselves.\"",
    "nextNode": "b1-155"
  },
  "b1-155": {
    "type": "DECISION",
    "content": "\"We can take one of the boats at the dock.\"\nAva: \"You're crazy. That will take too long. They are going to notice we aren’t here.\"\n\"It’ll be fine, there’s a ton of people working here, no way they notice we’re gone for a couple hours.\"\nAva: \"I don’t know...\"",
    "decisions": [
      ["You have a better solution?", "b1-156", 0],
      ["You gotta take risks in life", "b1-157", 0]
    ]
  },
  "b1-156": {
    "type": "CONTINUE",
    "content": "You have a better solution? It’s either this or confess to Dr. Jacobs.",
    "nextNode": "b1-158"
  },
  "b1-157": {
    "type": "CONTINUE",
    "content": "Sometimes you have to take risks in life Ava.",
    "nextNode": "b1-158"
  },
  "b1-158": {
    "type": "DECISION",
    "content": "Ava: \"Ugh alright numnuts.\"\nAva: \"Fine. I guess as long as I’m with Mr. Hendricks’ star pupil, I should be fine.\"\n\"Now we’re talking! Let’s go!\"",
    "decisions": [["Walk to the dock", "b1-159", 0]]
  },
  "b1-159": {
    "type": "CONTINUE",
    "content": "You and Ava sneak off to the dock.\nYou hop on a boat and see the keys already in the ignition.\nAva: \"Wait… do you even know how to drive this thing?\"\n\"Yes of course! My dad and I used to go all the time when I was a kid.\"\n\"I basically became a captain just by watching him.\"\nYou start the engine and you feel the boat come to life beneath your feet.\nAva: \"Full steam ahead! Just head north.\"",
    "nextNode": "b1-160"
  },
  "b1-160": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "You sail for an hour, enjoying the light small talk.\nAva: \"Ok perfect, we’re here.\"\nAva scoops the water below and obtains the sample.\nAva: \"Let's head on back.\"\nYou pull the throttle and the boat doesn’t move\nAva: \"Come on! Hurry up, let's go!\"\n\"Uhhh.. I’m trying…\"\nAva: \"What!? I thought you said you knew how to drive this thing.\"\nYou continue to yank the throttle and the engine roars.",
    "nextNode": "b1-161"
  },
  "b1-161": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "CLUNK\nThe engine blows. You look down at it in disbelief. It’s clogged with kelp.\n\"Yeah, remember that time I said I knew how to drive a boat.\"\nAva glares at you in frustration.\n\"The last time we went fishing was when I was five...I might be a little rusty.\"\nAva: \"Ya think!? Way to go, numnuts.\"",
    "decisions": [
      ["You think you could have done better", "b1-162", 0],
      ["We have to call for help", "b1-163", 0]
    ]
  },
  "b1-162": {
    "type": "CONTINUE",
    "content": "\"You think you could have done any better?\"\nAva: \"Hey! I’m not the one who claimed to be a captain!\"\n\"Alright alright, fair enough.\"",
    "nextNode": "b1-164"
  },
  "b1-163": {
    "type": "CONTINUE",
    "content": "\"My bad, guess we have to call for help now.\"\nAva: \"We just have to wait for a patrol boat. I think they run the parameter every few hours.\"\n\"Well, we might as well get comfortable.\"\nYou guys take a seat, as your boat floats to nowhere.",
    "nextNode": "b1-164"
  },
  "b1-164": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Ava: \"Man I really wish your dad had taught you how to drive through kelp.\"\n\"Haha, I bet he would have taught me too… but well, he never had the chance to.\"\nYou gaze off into the distance. \nBoth of you sit in silence, as the sun sets below the horizon. \nAva: \"I’m so sorry to hear that.\"\nAva: \"I know how it feels to lose a parent...\"\n\"Yeah it sucks….once he took a second shift at Walmart I barely got to see him anymore.\"\nAva looks at you in awe\nAva: \"Are you kidding me?! You’re dad’s alive?\"",
    "nextNode": "b1-165"
  },
  "b1-165": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "\"Na I’m just joking, he’s for sure dead.\"\nYou suddenly look behind you\n\"DAD? Is that you?!\"\n\"Nope, still dead.\"\nAva: \"I’m at a loss for words numnuts. Can you not take any situation seriously?\"\n\"Well, ever since I was a kid my mom always told me to keep smiling.\"\n\"And ever since that day I never wanted to be sad about losing him. I wanted to be happy about the times we had.\"",
    "nextNode": "b1-166"
  },
  "b1-166": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "'Ava: \"Felix, I...That’s such a brave way to think about it. I wish I could do the same.\"\nAva:  \"He ditched us when I was a baby, so I can’t say I’m grateful for the times we never had.\"",
    "decisions": [
      ["I'm sorry", "b1-167", 0],
      ["Must have been hard for you", "b1-168", 0]
    ]
  },
  "b1-167": {
    "type": "CONTINUE",
    "content": "\"I’m sorry to hear that.\"\nAva: \"That’s alright, I’m used to getting by with a single parent.\"",
    "nextNode": "b1-169"
  },
  "b1-168": {
    "type": "CONTINUE",
    "content": "\"Must have been hard for you.\"\n\"I can’t imagine not even having an image of your father in your head.\"\nAva: \"Yeah… I don’t even remember how he looks like…\"\nAva: \"But, my mom is all I need. I’m glad he never came back.\"",
    "nextNode": "b1-169"
  },
  "b1-169": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Ava: \"That’s why I’m working here, on this island. All my life we’ve been struggling. Finally with this job, my mom can live without worry.\"\n\"I can’t imagine the strength it took to endure all the hardships to get to this point\"\n\"Your mom must be so proud.\"\nAva: \"Wow, thanks Felix, you saying that means a lot.\"",
    "nextNode": "b1-170"
  },
  "b1-170": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Out of the corner of your eye you see a patrol boat in the distance.\n\"The boat! It’s here!\"\n\"HEYYY OVER HERE!!\"\nYou and Ava frantically wave your hands trying to draw the boat’s attention.\nThe boat begins to head toward you.\nAva: \"Finally! We’re saved!\"\n\"It’s about time! I think I’ve forgotten what land looks like. What food tastes like. What the dirt feels like!\"",
    "nextNode": "b1-171"
  },
  "b1-171": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Ava: \"Oh shut up, it’s been two hours.\"\nThe patrol boat pulls you to shore.\nAva: \"Let's head back to the lab and get our stuff.\"",
    "decisions": [["Walk to the lab", "b1-172", 0]]
  },
  "b1-172": {
    "type": "CONTINUE",
    "content": "You enter the lab, and see the rest of your coworkers still working.\n\"Do these guys not take a break? It’s almost 6pm.\"\nAva: \"Yeah, we work pretty hard here. So, let’s get back to it.\"\nYou and Ava work on restoring the water samples.",
    "nextNode": "b1-173"
  },
  "b1-173": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "After a while, you hear footsteps approaching you.\nYou look up and see Dr. Jacobs.\nDr. Jacobs: \"Hey Felix. Mr. Boss Man wants to see you. Better get a move on!\"",
    "decisions": [
      ["What does he want?", "b1-174", 0],
      ["Am I in trouble?", "b1-175", 0]
    ]
  },
  "b1-174": {
    "type": "DECISION",
    "content": "\"What does he want?\"\nDr. Jacobs: \"Beats me. Probably gonna fire you.\"\nDr. Jacobs: \"Just pulling your leg, or maybe not. I don’t know. The guy is a wildcard.\" \nYou look at Ava, and she shrugs her shoulders.\nDr. Jacobs: \"Best you leave now kid.\"",
    "decisions": [["Walk to Mr. Hendrick's office", "b1-176", 0]]
  },
  "b1-175": {
    "type": "DECISION",
    "content": "\"Am I in trouble?\"\nDr. Jacobs: \"I’m sure it’s nothing...or is it? He usually never does this.\"\n\"Really?!\"\nDr. Jacobs: \"Ahhh I’m sure you’re fine...I mean it’s not like you’ve screwed anything up, right?\"\n\"Right.\"\nYour face turns red as you put your head down and leave the lab.",
    "decisions": [["Walk to Mr. Hendrick's office", "b1-176", 0]]
  },
  "b1-176": {
    "type": "CONTINUE",
    "content": "You walk to Hendrick’s office and knock on the door.\nMr. Hendricks: \"Come in my boy.\"\nYou enter the room and see Eddie already sitting down.\nYou take a seat.\nMr. Hendricks: \"Felix, I normally don’t interrupt people from their work, but this situation calls for special measures.\"\n\"Situation? Sir what do you mean?\"",
    "nextNode": "b1-177"
  },
  "b1-177": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"Well you see my boy, when you’re in the business of creating life changing work, people become envious.\"\nMr. Hendricks: \"It has come to my attention that there is a spy among us on the Island.\"\nEddie: \"A Spy?! This is starting to sound like a Jason Bourne movie.\"\nMr. Hendricks: \"I’m sorry, Jason was born?\"\nEddie: \"Wait you’ve never seen Jason Bourne?\"\n\"Eddie, I don’t think that’s important right now.\"",
    "nextNode": "b1-178"
  },
  "b1-178": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Eddie: \"yeah yeah you’re right. Sorry Mr. Hendricks. As you were saying?\"\nMr. Hendricks gives a sigh and collects himself.\nMr. Hendricks: \"Yes, well my competitors wish to steal our research for profit. Whereas I intend to provide our tech for free.\"\nMr. Hendricks: \"Unfortunately I am unable to fully trust any of my peers. However you both just arrived, I have full confidence in you.\"\nMr. Hendricks: \"It is imperative that you boys help me with this. Please report any suspicious activity.\"",
    "decisions": [
      ["Tell him about threatening note", "b1-179", 0],
      ["Don't tell him about threatening note", "b1-180", 0]
    ]
  },
  "b1-179": {
    "type": "CONTINUE",
    "content": "\"Last night… I got a strange note.\"\n\"It read \"Get Out\" in large red letters. It was scary.\"\nMr. Hendricks: \"Hmmm. That is peculiar. Quite a vague threat.\"\nMr. Hendricks: \"Must be connected to the spy situation. Be vigilant, but careful.\"",
    "nextNode": "b1-181"
  },
  "b1-180": {
    "type": "CONTINUE",
    "content": "\"This all sounds so crazy, but you can count on us Mr. Hendricks.\"\n\"We’ll let you know if we see anything suspicious.\"\nEddie: \"Don’t worry Mr. H, we’ll take care of the bad guys for you, Bourne style!\"\nMr. Hendricks: \"Please my boys, I am only asking you to keep a lookout, do not attempt anything drastic...or anything this Bourne fellow might do...he sounds like a troublemaker.\"\nEddie: \"Oh you don’t even know the half of it Mr. H! You see in the sequel Jason...\"\nYou interrupt Eddie.\n\"Eddie! That’s enough we should leave.\"",
    "nextNode": "b1-181"
  },
  "b1-181": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"That is all, thanks for coming. Remember, don’t tell a soul.\"\nYou both nod and leave the office.\nEddie: \"I got a bit more work to catch up on, but I’ll see you for dinner.\"\n\"Ok sounds good, I think I’m gonna go on a walk. Need to clear my head.\"",
    "decisions": [["Walk", "b1-182", 0]]
  },
  "b1-182": {
    "type": "CONTINUE",
    "content": "You start walking towards the beach.\nTime blurs as you walk past the buildings and eventually past your bungalow.\nYou reflect on all the things that have happened since you’ve gotten here.\n\"Why would anyone give you that note?\"\n\"Who’s the spy? Could it be someone you know?\"\nThe sand tickles your toes.\nYour feet hit the water and you look up.",
    "nextNode": "b1-183"
  },
  "b1-183": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "The sky is painted with a flurry of pink and orange. You feel the warmness on your skin.\nOne deep breath, and the sea breeze fills your head.\nIn the distance, you see a pod of dolphins swimming in harmony.\nIt takes you back to the first time you saw a dolphin with your Dad.\nYou always hated waking up so early and the drive was long, but he always said it would be worth it.\nAnd it was.",
    "decisions": [["Keep walking", "b1-184", 0]]
  },
  "b1-184": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You keep walking, and see a trail veering of into a forest.\nSoon the trail disappears.\nAfter a while you turn around, but you have no clue where you came from.\n\"Great, just my luck.\"",
    "decisions": [
      ["Walk right", "b1-185", 0],
      ["Walk left", "b1-186", 0]
    ]
  },
  "b1-185": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You turn right and keep walking.\nYou take a step and mud splatters onto your legs.\n\"Darnit, I just got these shoes.\"\nSlowly, you begin to sink into the ground.\n\"What?! Quicksand?! I thought this was just in the movies.\"\nYou grab a nearby tree branch and pull yourself out.\n\"That was close…\"",
    "decisions": [["Walk left", "b1-186", 0]]
  },
  "b1-186": {
    "type": "CONTINUE",
    "content": "You decide to walk to the left.\nThere is no trail, but you follow a grass path through the thick brush.\n\"Jeez hopefully this leads to a trail.\"\nAfter walking for a bit, the elevation gains and you stumble on a massive rocky area.\n\"Maybe if I climb it I’ll be able to see how to get back.\"\nYou hike up the boulder and get a clear view of the nearby area.\nAbout 40 feet away you barely make out what looks like a door hidden between the rocks and trees.\n\"What the hell is that?\"",
    "nextNode": "b1-187"
  },
  "b1-187": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Your curiosity goes wild. You climb down the boulder and make your way to the door.\nNow you can see the door clearly.\nIt has a keypad and a facial recognition scanner next to it.\n\"This is some high tech stuff...doesn’t look old and abandoned.\"\nSuddenly, you hear the door crank as if massive steel gears were turning.\nYou quickly hide behind a bush and stay quiet.\nYour heart is pounding as the door swings open. \nThree men in lab suits walk out, only darkness behind them.",
    "nextNode": "b1-188"
  },
  "b1-188": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You peek your head out of the bush.\nYou recognize the man in the middle. Dr. Jacobs.\nThe two other scientists push out a cart stacked with large white boxes.\nAt the bottom of each box, there is some dark mass.\nLooking more closely, you make out the motionless silhouettes of legs, antlers, small heads...\nDr. Jacobs: \"Hell of a meeting boys. We’re almost ready for phase 1.\"\nDr. Jacobs: \"Project Sahaya is officially underway.\"",
    "decisions": [["Next", "b1-189", 0]]
  },
  "b1-189": {
    "type": "CONTINUE",
    "content": "Part 1 complete.\nTo be continued...",
    "nextNode": "b1-190"
  }
}
