{
  "root": {
    "type": "DECISION",
    "content": "Dad: \"Go long Felix!\"\nYou take off running down the field and see the ball racing past you.\n\"I got it, I got it!\"\nYou look down and see a lot of mud.",
    "decisions": [
      ["Dive for the ball", "b1-1", 0],
      ["Let the ball go", "b1-2", 0]
    ]
  },
  "b1-1": {
    "type": "DECISION",
    "content": "You dive for the ball and land in the mud.\nThe ball lands in front of you, missing your glove.\nDad: \"Oh, so close! Good effort though!\"\nDad: \"Lets head back for dinner, but you better wash before your mom sees you all muddy!\"",
    "decisions": [["Walk back to Dad", "b1-3", 0]]
  },
  "b1-2": {
    "type": "DECISION",
    "content": "You let the ball go and it falls in the mud.\nDad: \"That's alright, you’ll get it next time!\"\nDad: \"It's getting late, let's head back for dinner.\"",
    "decisions": [["Walk back to Dad", "b1-3", 0]]
  },
  "b1-3": {
    "type": "CONTINUE",
    "content": "Dad: \"Great job today Felix, you’re looking ready for this week’s game!\"\n\"I don’t know Papa. I missed almost every catch today...\"\nDad: \"Listen Felix, what's important is that you always try your hardest, even if you think you’ll fail. Now come on, let’s head inside.\"",
    "nextNode": "b1-4"
  },
  "b1-4": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "At the front door, standing there with her hands on her hips is Mom.\nMom: \"Hurry, the food is getting cold! I told you two to come home before it gets dark.\"\nMom: \"I swear it's like anytime I tell you something it goes through one ear and out the other.\"\nMom: \"You need to wake up! Wake up! Wake up!\"",
    "nextNode": "b1-5"
  },
  "b1-5": {
    "type": "DECISION",
    "content": "You open your eyes and see Mom standing at your door.\nMom: \"Wake up Felix and come down for breakfast\"\nMom: \"Remember, it's college day today.\"",
    "decisions": [
      ["Okay im getting up", "b1-6", 0],
      ["5 more minutes", "b1-7", 0]
    ]
  },
  "b1-6": {
    "type": "CONTINUE",
    "content": "Okay, okay. I'm getting up.",
    "nextNode": "b1-8"
  },
  "b1-7": {
    "type": "CONTINUE",
    "content": "\"5 more minutes Mom.\"\nMom: \"Okay, but hurry. You’re going to be late to school.\"",
    "nextNode": "b1-8"
  },
  "b1-8": {
    "type": "DECISION",
    "content": "You get out of bed and step on your 4th place ribbon from last week’s science fair.\n\"How did this get here? Must have fallen from the wall.\"\nStaring at the ribbon you think to yourself what a disappointment that fair was.\n\"Man we had the best project there, we should have at least gotten 2nd place...whatever.\"",
    "decisions": [
      ["Throw away ribbon", "b1-9", 0],
      ["Put ribbon back on wall", "b1-10", 0]
    ]
  },
  "b1-9": {
    "type": "CONTINUE",
    "content": "You throw the ribbon in the trash and get ready for school.",
    "nextNode": "b1-11"
  },
  "b1-10": {
    "type": "CONTINUE",
    "content": "You place the ribbon back on the wall and get ready for school.",
    "nextNode": "b1-11"
  },
  "b1-11": {
    "type": "DECISION",
    "content": "Mom: \"Hurry Felix, you’re going to be late.\"\nYou run downstairs for breakfast and dig into your eggs and toast.\nMom: \"Did you sleep well?\"",
    "decisions": [
      ["Yeah", "b1-12", 0],
      ["Tell her about dream", "b1-13", 0]
    ]
  },
  "b1-12": {
    "type": "CONTINUE",
    "content": "\"Yeah I slept fine. Excited for my last week of high school.\"\nMom: \"I can’t believe you’re already headed off to college!\"",
    "nextNode": "b1-14"
  },
  "b1-13": {
    "type": "CONTINUE",
    "content": "\"I saw Papa again… We were playing catch just like old times.\"\nMom: \"I know you miss him, and things haven’t been easy.\"\nMom: \"But we’ve come so far since then…\"\nMom: \"Now look at you, all grown up and off to college.\"",
    "nextNode": "b1-14"
  },
  "b1-14": {
    "type": "DECISION",
    "content": "Mom: \"You look just like Papa in his Duke t-shirt.\"\nYou quietly look down at your plate.\nMom: \"He would have been so proud of you honey.\"",
    "decisions": [
      ["Thanks", "b1-15", 0],
      ["I hope so", "b1-16", 0]
    ]
  },
  "b1-15": {
    "type": "CONTINUE",
    "content": "\"Thanks Mom. See you after school.\"",
    "nextNode": "b1-17"
  },
  "b1-16": {
    "type": "CONTINUE",
    "content": "\"I sure hope so…\"",
    "nextNode": "b1-17"
  },
  "b1-17": {
    "type": "DECISION",
    "content": "You finish your plate and head to school.",
    "decisions": [["Walk to school", "b1-18", 0]]
  },
  "b1-18": {
    "type": "DECISION",
    "content": "You walk into class and take a seat.\nMr. Davies: \"Alright class, grad practice starts soon so chat amongst yourselves until then.\"\nAlly: \"Hey Felix! Do you want to sign each other’s yearbooks?\n\"Yeah sure.\"\nYou and Ally exchange yearbooks.\nWhat do you write?",
    "decisions": [
      ["HAGS", "b1-19", 0],
      ["Let's stay in touch!", "b1-19", 0],
      ["(Long emotional letter)", "b1-19", 0],
      ["(Leave it blank)", "b1-19", 0]
    ]
  },
  "b1-19": {
    "type": "DECISION",
    "content": "Intercom: \"FELIX HERNANDEZ PLEASE REPORT TO THE PRINCIPAL'S OFFICE IMMEDIATELY.\"\nYour stomach drops.\nAlly: \"Oooo sounds like someones in trouble.\"\n\"Ha ah ha I hope not...\"\nYou exchange back yearbooks and leave class.",
    "decisions": [["Walk to principal’s office", "b1-20", 0]]
  },
  "b1-20": {
    "type": "CONTINUE",
    "content": "You get to the entrance and stop.\n\"What could I possibly be in trouble for?\"\n\"... Oh maybe they found out (something funny and not that bad)\"\n\"Well only one way to find out.\"\nYou open the door and walk in.",
    "nextNode": "b1-21"
  },
  "b1-21": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Principal Khosla: \"Felix, please take a seat. Someone wants to speak with you.\"\nAn older gentleman with a cane walks in.\nOlder Gentleman: \"Greetings Felix. Do you remember me?\"\nYou study his face and he looks vaguely familiar.",
    "decisions": [
      ["No, sorry", "b1-22", 0],
      ["Yes, of course", "b1-23", 0]
    ]
  },
  "b1-22": {
    "type": "CONTINUE",
    "content": "\"Hmm no sorry, I don't think so.\"\nOlder Gentleman: \"Well that's a surprise, I thought you would most certainly remember me.\"",
    "nextNode": "b1-24"
  },
  "b1-23": {
    "type": "CONTINUE",
    "content": "\"Yeah, you’re Chevy Chase right?\"\nOlder Gentleman: \"Huh?\"\n\"Ya the old dude from Community!\"\n\"The show was never the same after you left.\"\nOlder Gentleman: \"What? Oh heavens no you’re mistaken.\"",
    "nextNode": "b1-24"
  },
  "b1-24": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"My name is Mr. Hendricks. I was one of the panelists at the science fair.\"\nYou remember reading about him in an article...\nArthur Hendricks made billions through pharmaceuticals and made headlines by committing himself entirely to philanthropy.\nMr. Hendricks: \"I was mighty impressed with your analysis regarding the varying salinity levels of our vast oceans.\"",
    "decisions": [
      ["Thanks", "b1-25", 0],
      ["Really? We got fourth place.", "b1-26", 0]
    ]
  },
  "b1-25": {
    "type": "CONTINUE",
    "content": "\"Thank you Mr Hendricks, feels good to have our work recognized.\"",
    "nextNode": "b1-27"
  },
  "b1-26": {
    "type": "CONTINUE",
    "content": "\"Really? You’re impressed with a  4th place project?\"\n\"If only the other panelists thought so too.\"",
    "nextNode": "b1-27"
  },
  "b1-27": {
    "type": "DECISION",
    "content": "Mr Hendricks: \"The other panelists failed to recognize the brilliance behind your methods.\"\nMr. Hendricks: \"For decades I have worked tirelessly to improve the lives of those less fortunate.\"\nMr. Hendricks: \"Now I have began work on my most ambitious feat - Purification of ocean water through desalination methods\"",
    "decisions": [
      ["Sounds interesting", "b1-28", 0],
      ["Why me?", "b1-29", 0]
    ]
  },
  "b1-28": {
    "type": "CONTINUE",
    "content": "\"Sounds interesting, this could help billions of people around the world.\"\nMr. Hendricks: \" I’m glad you realize the great potential of our work Felix.\"",
    "nextNode": "b1-30"
  },
  "b1-29": {
    "type": "CONTINUE",
    "content": "\"That's great and all, but what does this have to do with me?\"",
    "nextNode": "b1-31"
  },
  "b1-30": {
    "type": "DECISION",
    "content": "Mr. Hendricks: \"Your past research and bright mind could be monumental in our efforts.\"\nMr. Hendricks: \"I would love for you to join me in our state of the art research laboratory. This of course would come with a generous salary.\"\nMr. Hendricks: \"How does that sound?\"",
    "decisions": [
      ["Sounds fantastic!", "b1-31", 0],
      ["I don’t know…", "b1-32", 0]
    ]
  },
  "b1-31": {
    "type": "CONTINUE",
    "content": "\"That sounds fantastic! I can’t wait to tell Eddie about our job offers.\"",
    "nextNode": "b1-34"
  },
  "b1-32": {
    "type": "CONTINUE",
    "content": "\"I don’t know...my plan was always to go to college.\"\nMr. Hendricks: \"Listen Felix, what we’re trying to accomplish here will bring real change and have immediate impacts on those who need it the most.\"\n\"Hmm that sounds like a great opportunity. I need some time to think about this though...\"",
    "nextNode": "b1-33"
  },
  "b1-33": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"Felix all I am saying is give us a chance. Work here for 3 months and if it’s not a good fit you can go back to college then. I’ll even pay your whole tuition.\"\n\"Well if that's the case I don’t see why not? Seems like a good opportunity either way.\"\n\"Eddie’s going to be so excited to take this opportunity with me.\"",
    "nextNode": "b1-34"
  },
  "b1-34": {
    "type": "DECISION",
    "content": "Mr. Hendricks: \"Splendid! It pleases me to hear you’ll join us.\"\nMr. Hendricks: \"However, I’m afraid I made myself unclear. This proposal is only for you.\"\n\"Wait what? We worked on that project together!\"",
    "decisions": [
      ["Eddie helped", "b1-35", 0],
      ["It was 50/50 split", "b1-36", 0]
    ]
  },
  "b1-35": {
    "type": "CONTINUE",
    "content": "\"Eddie contributed a lot to the project.\"",
    "nextNode": "b1-37"
  },
  "b1-36": {
    "type": "CONTINUE",
    "content": "\"Eddie did as much work as I did.\"",
    "nextNode": "b1-37"
  },
  "b1-37": {
    "type": "DECISION",
    "content": "Mr. Hendricks: \"Come on now Felix, we both know YOU were the real brains behind the operation.\"\nMr. Hendricks: \"Felix my boy, remember these words. Never allow personal relationships to hinder your true potential. \"",
    "decisions": [
      ["Eddie is smart and capable", "b1-38", 0],
      ["Don’t want to leave Eddie", "b1-39", 0]
    ]
  },
  "b1-38": {
    "type": "CONTINUE",
    "content": "\"You’re wrong! Eddie is a smart and capable mind. I won’t go without him.\"",
    "nextNode": "b1-40"
  },
  "b1-39": {
    "type": "CONTINUE",
    "content": "\"That may be true, but Eddie and I have been through everything together\"\n\"There’s no way I’ll leave without him.\"",
    "nextNode": "b1-40"
  },
  "b1-40": {
    "type": "DECISION",
    "content": "For a moment Mr. Hendricks studies Felix’s eyes.\nYou stare back at him with unwavering conviction.\nMr. Hendricks: \"Well it's clear there's no changing your mind.\"\nMr. Hendricks: \"I guess we can find something he can do.\"",
    "decisions": [
      ["Sounds good I still have to check with my mom", "b1-41", 0],
      ["Perfect, Eddie is going to be so excited!", "b1-42", 0]
    ]
  },
  "b1-41": {
    "type": "CONTINUE",
    "content": "\"Sounds good, I still have to check with my mom.\"",
    "nextNode": "b1-43"
  },
  "b1-42": {
    "type": "CONTINUE",
    "content": "\"Perfect, Eddie is going to be so excited.\"",
    "nextNode": "b1-43"
  },

  "b1-43": {
    "type": "CONTINUE",
    "content": "Mr. Hendricks: \"Great...oh and I forgot to mention - we leave tomorrow at dawn.\"\nMr. Hendricks: \"Worry not, I already made arrangements with your school..\"\nMr. Hendricks: \"Principal Kholsa here has assured me everything will be taken care of.\"\nPrincipal Kholsa gives Mr. Hendricks a slight nod.",
    "nextNode": "b1-44"
  },
  "b1-44": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "The bell rings and it’s now lunch time.\nMr. Hendricks: \"This is goodbye for now Felix, see you tomorrow.\"\n\"Okay sounds good.\"\nYou leave the office and excitedly rush to find Eddie.",
    "decisions": [["Walk to cafeteria", "b1-45", 0]]
  },
  "b1-45": {
    "type": "DECISION",
    "content": "Eddie: \"What’s happening? They said I can go home?\"\n\"You won’t believe what happened\"",
    "decisions": [["Tell Eddie about opportunity", "b1-46", 0]]
  },
  "b1-46": {
    "type": "DECISION",
    "content": "You tell Eddie about the opportunity.\nEddie: \"What?! No way! That’s incredible.\"\nEddie: \"Honestly this sounds better than college anyways, and this way we’ll be able to stick together.\"\nEddie: \"And not to mention the money we’ll make!\"",
    "decisions": [
      ["The money would be nice", "b1-47", 0],
      ["We’re going to learn so much!", "b1-48", 0]
    ]
  },
  "b1-47": {
    "type": "CONTINUE",
    "content": "\"Yeah, the money would be nice I guess..\"\n\"We definitely wouldn’t have the typical ramen experience of a college student haha.\"",
    "nextNode": "b1-49"
  },
  "b1-48": {
    "type": "CONTINUE",
    "content": "\"Yeah! Also think about how much we would learn in this environment.\"\n\"Definitely more than we would ever learn in college!\"",
    "nextNode": "b1-49"
  },
  "b1-49": {
    "type": "DECISION",
    "content": "\"We leave tomorrow, so we better get packing.\"\nEddie: \"This is going to be so fun! \nEddie: \"I can’t wait! I’m going to head home and tell my family.\"\n\"Ok see you tomorrow bright and early!\"",
    "decisions": [["Head home", "b1-50", 0]]
  },
  "b1-50": {
    "type": "DECISION",
    "content": "You walk through the front door.\nMom: \"Oh Felix is it true?! The principal told me all about your opportunity!\"\nMom: \"That’s so exciting!\"\n\"Yeah Mom it’s true. I can’t believe it!\"",
    "decisions": [
      ["I wanted to check with you first", "b1-51", 0],
      ["I’m leaving tomorrow", "b1-52", 0]
    ]
  },
  "b1-51": {
    "type": "CONTINUE",
    "content": "\"I just wanted to check with you first before I leave.\"\n\"This all is happening so fast.\"\nMom: \"Thanks for checking in with me honey.\"\nMom: \"If this is really what you want, I fully support it!\"",
    "nextNode": "b1-53"
  },
  "b1-52": {
    "type": "CONTINUE",
    "content": "\"The plane leaves tomorrow.\"\n\"I know it's sudden but I’m confident it's the right choice for me.\"\nMom: \"Well it seems my little boy is making decisions for himself now!\"",
    "nextNode": "b1-53"
  },
  "b1-53": {
    "type": "DECISION",
    "content": "Mom: \"I know your father always wanted to see you go to his alma mater.\"\nYou look down at your Duke shirt.\nMom: \"But this sounds like an opportunity for you to be a part of a great cause.\"",
    "decisions": [
      ["Going to learn so much", "b1-54", 0],
      ["Going to make real change", "b1-55", 0],
      ["Still want to attend Duke one day", "b1-56", 0]
    ]
  },
  "b1-54": {
    "type": "CONTINUE",
    "content": "\"Yeah, I’m going to learn so much in that environment Mom.\"\n\"Their laboratory sounds incredible!\"",
    "nextNode": "b1-57"
  },
  "b1-55": {
    "type": "CONTINUE",
    "content": "\"It does! I really feel like this will allow me to make a real difference.\"\n\"785 million people lack access to a basic drinking-water service.\"\n\"This includes 144 million people who are just dependent on surface water!\"\n\"Hopefully my work will help those suffering from the water crisis.\"",
    "nextNode": "b1-57"
  },
  "b1-56": {
    "type": "CONTINUE",
    "content": "\"Yeah, and I haven’t forgotten about how important Duke was to Dad.\"\n\"I still want to attend some day.\"",
    "nextNode": "b1-57"
  },
  "b1-57": {
    "type": "CONTINUE",
    "content": "Mom: \"I’m so proud of you Felix. I think this is the right choice for you.\"\nMom: \"Let’s go upstairs and I’ll help you pack.\"\nYou and Mom head upstairs.\nYou go to sleep after dinner.",
    "nextNode": "b1-58"
  },
  "b1-58": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Your 5:30 am alarm rings loudly and instinctively you reach for snooze.\nBut, your excitement shoots you right out of bed.\nMom: \"FEELLLIXX. There’s some car outside waiting for you.\"\nYou quickly get ready and head downstairs.\nMom: \"I’m going to miss you so much Felix. Make sure to call from time to time.\"\n\"Don’t worry I will Mom. You can always come visit.\"\nYou hug your Mom goodbye and head out the door",
    "nextNode": "b1-59"
  },
  "b1-59": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mom: \"Felix wait! You forgot this!\nShe hands you your 4th place ribbon from the science fair.",
    "decisions": [
      ["Thanks Mom", "b1-60", 0],
      ["Keep it in my room", "b1-61", 0]
    ]
  },
  "b1-60": {
    "type": "DECISION",
    "content": "\"Thanks Mom, I’ll put it in my new room.\"\nYou put the ribbon in your backpack.",
    "decisions": [["Walk to car ", "b1-62", 0]]
  },
  "b1-61": {
    "type": "DECISION",
    "content": "\"Thanks Mom, but actually can you keep that in my room.\"",
    "decisions": [["Walk to car ", "b1-62", 0]]
  },
  "b1-62": {
    "type": "CONTINUE",
    "content": "Driver: \"Alright. Mr. Hernandez, we’ve reached our destination.\"\n\"Thanks!\"\nYou step out of the car onto a small airfield.\nMr. Hendricks waves to you standing in front of a small jet.\nMr. Hendricks: \"Felix my boy, come come. Let’s get you settled in.\"\nMr. Hendricks: \"Help yourself to any refreshments… that is if our friend Eddie hasn’t already devoured them aha ha.\"",
    "nextNode": "b1-63"
  },
  "b1-63": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You walk up the stairs into the jet and take a seat.\nEddie: \"Hey Felix! You check out these snacks!? They got every soda you can think of!\"\nEddie: \"And do you see these enormous seats! They go all the way back!\"",
    "decisions": [
      ["It's amazing", "b1-64", 0],
      ["It really is someting else", "b1-65", 0]
    ]
  },
  "b1-64": {
    "type": "CONTINUE",
    "content": "\"This plane is amazing! I can get used to this.\"",
    "nextNode": "b1-66"
  },
  "b1-65": {
    "type": "CONTINUE",
    "content": "\"Uhh you’re right this plane really is something else.\"",
    "nextNode": "b1-66"
  },
  "b1-66": {
    "type": "CONTINUE",
    "content": "Eddie: \"And these chips! Don't even get me started! They’re the crispiest I’ve ever tasted!\"\n\"Eddie I’m pretty sure those are the same chips we get at school.\"\nEddie: \"Really?! I don’t know man, these just taste CRISPIER for some reason.\"\nMr. Hendricks takes a seat in front of you.",
    "nextNode": "b1-67"
  },
  "b1-67": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"As we speak we are headed towards a private Island 76 nautical miles off the coast of Guam.\"\nMr. Hendricks: \"I have given you both a brief overview of our monumental efforts, but it’s time you understood what we are truly trying to accomplish.\"",
    "decisions": [
      ["Wait... an island?", "b1-68", 0],
      ["Eddie, you okay?", "b1-69", 0]
    ]
  },
  "b1-68": {
    "type": "CONTINUE",
    "content": "Wait… did you say an island?",
    "nextNode": "b1-70"
  },
  "b1-69": {
    "type": "CONTINUE",
    "content": "You look over and see Eddie hunched over grabbing his stomach in discomfort.\n\"Hey Eddie, you okay?\"\nEddie: \"Yea I think 9 sodas was one too many...and not to mention my extreme fear of heights.\"\nEddie: \"But wait.. Did Hendricks say something about an island?\"\nMr. Hendricks looks at Eddie and gestures to the flight attendant.",
    "nextNode": "b1-70"
  },
  "b1-70": {
    "type": "DECISION",
    "content": "'Mr. Hendricks: \"Yes. Our laboratory was built on an island. Prime location for our salinity testing using our research vessels.\"",
    "decisions": [
      ["Beaches sound amazing", "b1-71", 0],
      ["Very convenient gathering samples", "b1-72", 0]
    ]
  },
  "b1-71": {
    "type": "CONTINUE",
    "content": "'\"The beaches on the island must be incredible!\"\nMr. Hendricks: \"Aha ha my boy, yes the Island is truly breathtaking...\"\nMr. Hendricks: \"But I hope you take full advantage of our research facilities.",
    "nextNode": "b1-73"
  },
  "b1-72": {
    "type": "CONTINUE",
    "content": "\"That’s awesome! We’ll be able to gather our own test samples.\"\nMr. Hendricks: \"Our research facilities are indeed state of the art…\"\nMr. Hendricks: \"But I hope you also enjoy the unrivaled beauty of the Island.\"",
    "nextNode": "b1-73"
  },
  "b1-73": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks looks out the plane window at the islands beneath us.\nMr. Hendricks: \"It seems like a lifetime ago when I embarked on this mission.\"\nMr. Hendricks: \"33 years ago our company went on a humanitarian trip to an impoverished village.\"\nMr. Hendricks: \"Granted, the trip’s sole purpose was to gain good publicity, but something I saw changed me forever.\"",
    "nextNode": "b1-74"
  },
  "b1-74": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"It wasn’t the absence of electricity, the lack of clean water, or even the poor infrastructure…\"\nMr. Hendricks: \"What changed me was the hope. This notion of hope was never shared explicitly, but rather seen through small moments.\"\nMr. Hendricks: \"Through the laughter of children playing soccer…the sparkle in a mother’s eyes looking at her infant child. These moments were forever ingrained in my mind.\"\nMr. Hendricks: \"But alas, this future they hope for is simply unattainable…\"",
    "decisions": [
      ["Unattainable?", "b1-75", 0],
      ["We can help!", "b1-76", 0]
    ]
  },
  "b1-75": {
    "type": "CONTINUE",
    "content": "\"Unattainable? There has to be something we can do!\"",
    "nextNode": "b1-77"
  },
  "b1-76": {
    "type": "CONTINUE",
    "content": "\"Are you saying the work we do can help?\"",
    "nextNode": "b1-77"
  },
  "b1-77": {
    "type": "CONTINUE",
    "content": "Mr. Hendricks: \"Yes, I plan to help the less fortunate in every way I can. Clean water is just the beginning.\"\nYou look out the window to see a bunch of small islands passing by. \nLooking more closely you see small houses and scattered farms.",
    "nextNode": "b1-78"
  },
  "b1-78": {
    "type": "CONTINUE",
    "reset": "TRUE",
    "content": "Mr. Hendricks: \"I have been aiding the people of this archipelago for decades with basic infrastructure, resources, and whatever else they may need.\"\nMr. Hendricks: \"We have maintained a close relationship with their leadership.\"\nMr. Hendricks: \"Last year, they generously allowed us to conduct our research on one of their many vacant islands.\"\nPilot: \"This is your pilot speaking. We are about to make our final descent.\"\nEveryone gets ready for landing.",
    "nextNode": "b1-79"
  },
  "b1-79": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "Pilot: \"Sorry for the rough landing folks. Although it wasn’t my fault... it was the asphalt.\"\nYou turn to see Eddie laughing while still hunched over in pain.\nYou thank the pilot and get off the airplane.\nMr. Hendricks: \"I have to take care of some things. Please follow my assistant Lauren for the tour.\"\nYou and Eddie walk toward Lauren.\nLauren: \"Hi, I’ll be showing you two around I guess. Follow me if you want!\"",
    "decisions": [["Follow Lauren to lab", "b1-79a", 0]]
  },
  "b1-79a": {
    "type": "CONTINUE",
    "content": "You follow Lauren to the entrance of the lab.\nLauren: \"This is the island’s main facility. This is where all our researchers work and stuff.\"\nEveryone walks inside of the facility.\nLauren: \"Welcome to the main lobby. You guys can check out the rest of the facility, or not. Do whatever.\"",
    "nextNode": "b1-80"
  },
  "b1-80": {
    "type": "DECISION",
    "content": "Lauren stands to the corner of the room on her phone.\n(Visit all locations and talk to everyone to end tour)",
    "decisions": [
      ["Go to cafeteria", "b1-81", 0],
      ["Go to research lab", "b1-82", 0],
      ["Go to break room", "b1-83", 0]
    ],
    "hiddenButton": ["End tour", "b1-95", 0]
  },
  "b1-81": {
    "type": "DECISION",
    "reset": "TRUE",
    "content": "You enter the cafeteria and notice the place to be mostly empty.\nYou see an older lady with a large sun hat sitting at the patio.",
    "decisions": [
      ["Talk to the lady", "b1-84", 0],
      ["Ask Lauren about room", "b1-85", 0],
      ["Head back to lobby", "b1-86", 0]
    ]
  },
  "b1-84": {
    "type": "DECISION",
    "content": "You approach the woman and she glances back at you.\nLady: \"Hello, are you new? I haven’t seen you around.\"\n\"Hi, I’m Felix. I just got to the island a few minutes ago.\"\nLady: \"Oh my husband hasn’t mentioned you. I’m Mrs. Hendricks. Pleasure.\"\nYou shake her hand.\nMrs. Hendricks: \"Let me know if you have any questions.\"",
    "decisions": [
      ["How's the food?", "b1-87", 0],
      ["What do you do around here?", "b1-88", 0]
    ]
  },
  "b1-87": {
    "type": "DECISION",
    "content": "\"How’s the food here?\"\nMrs. Hendricks: \"Satisfactory, although not quite up to my standards.\"\n\"Good thing I'm not picky!\"\n\"As long as there’s hot sauce lying around, I’m good to go.\"\nMrs. Hendricks: \"Ah I see...hot sauce...that will certainly SPICE things up!\"\nMrs. Hendricks clears her throat and checks the time\nMrs. Hendricks: \"Well if you’ll excuse me, I must bid you farewell. I’m sure we’ll meet again.\"",
    "decisions": [["Head back to cafeteria", "b1-89", 0]]
  },
  "b1-89": {
    "type": "CONTINUE",
    "content": "You head back to the cafeteria",
    "nextNode": "b1-81"
  },
  "b1-88": {
    "type": "DECISION",
    "content": "\"What do you do around here?\"\nMrs. Hendricks: \"Well a variety of things really. At times I assist my husband with basic operations, but I mostly focus on writing my novel.\"\n\"Woah you’re an author? That’s super cool. What are you writing about?\"\nMrs. Hendricks: \"A tale of discovery and righteousness.\"\nYou smile and nod your head pretending to know what that means.\nMrs. Hendricks: \"I must be on my way now Felix dear, this novel will not write itself!\"\n\"Of course, it was nice to meet you!\"",
    "decisions": [["Head back to cafeteria", "b1-89", 0]]
  },
  "b1-85": {
    "type": "CONTINUE",
    "content": "\"Hey Lauren can you tell me about the cafeteria.\"\nLauren: \"The cafeteria? People eat here. That’s about it.\"\n\"Do they serve lasagna?\"\nLauren: \"I don’t know, check the menu.\"\n\"I hate lasagna.\"\nLauren: \"Umm okay. Thanks for sharing.\"\nYou walk away.",
    "nextNode": "b1-81"
  },
  "b1-86": {
    "type": "CONTINUE",
    "content": "You head back to the lobby.",
    "nextNode": "b1-80"
  },
  "b1-82": {
    "type": "DECISION",
    "content": "You walk down the hall to find a large room labeled \"Research Lab.\"\n\"Oh this looks cool.\"\nYou open the door and walk in. You look in awe at the state of the art equipment.\nResearcher: \"Hey, what are you doing around here? Are you lost?\"\n\"Oh. Hi, I’m Felix. I just got to the island. I’m just checking the lab out.\"\nResearcher: \"The name’s Ryan. Dr. Jacobs to you. You must be one of the new interns.\"\nDr. Jacobs: \"I’m glad you’re kid, we got some vials that need a good scrubbing.\"\nDr. Jacobs: \"Put some elbow grease into it, you don’t want to end up like the last guy...\"",
    "decisions": [
      ["I'm not cleaning vials!", "b1-90", 0],
      ["Sorry, I'm not an intern", "b1-91", 0]
    ]
  },
  "b1-90": {
    "type": "DECISION",
    "content": "\"I didn’t come here to clean vials!\"\n\"Mr. Hendricks brought me here to conduct research on ocean salinity levels.\"\nDr. Jacobs: \"Looks like we’ve got a real hot shot over here! Isn’t that just dandy.\"\nDr. Jacobs: \"Now get lost kid, you still can’t be here. This is a private lab.\"\nYou exit the lab.",
    "decisions": [["Head back to lobby", "b1-86", 0]]
  },
  "b1-91": {
    "type": "DECISION",
    "content": "\"Sorry but I think you’re mistaken, I’m not an intern. I just started here as a full time researcher.\"\nDr. Jacobs: \"Oh is that so? Well well pardon my ignorance. How dare I mistake a prodigy like yourself for a measly intern!\"\nDr. Jacobs: \"However distinguished you may be, this is still a private lab. I trust you’re smart enough to find the door.\"\nYou leave the lab.",
    "decisions": [["Head back to lobby", "b1-86", 0]]
  },
  "b1-83": {
    "type": "DECISION",
    "content": "You enter the break room to see modern style couches, fun chairs, foosball table, and a mini bar with snacks and refreshments.\nAt one of the TVs is a girl about your age playing video games.",
    "decisions": [
      ["Talk to the girl", "b1-92", 0],
      ["Eat some snacks", "b1-93", 0],
      ["Ask Lauren about room", "b1-94", 0],
      ["Head back to the lobby", "b1-86", 0]
    ]
  },
  "b1-92": {
    "type": "CONTINUE",
    "content": "While walking towards her you trip on one of the wires and disconnect the gaming console.\nGirl: \"HEY WHAT'S YOUR PROBLEM!? I just lost because of you!\"\n\"Oh I’m so sorry I didn’t see the wire there. Here let me reconnect it\"\nGirl: \"It’s too late for that {INSERT LEGENDARY NICKNAME}!\"\nShe storms out of the room.",
    "nextNode": "b1-83"
  },
  "b1-93": {
    "type": "CONTINUE",
    "content": "You walk to the snack bar and see the last chocolate bar calling your name\nYou grab it and scarf it down.",
    "nextNode": "b1-83"
  },
  "b1-94": {
    "type": "CONTINUE",
    "content": "\"Hey Lauren what’s this room?\"\nLauren: \"As you can see, this is a break room. People take breaks here.\"\nLauren: \"Any other good questions?\"\n\"I guess not…\"",
    "nextNode": "b1-83"
  },
  "b1-95": {
    "type": "CONTINUE",
    "content": "You walk up to Lauren.\n\"Okay, I think we mostly checked out everything.\"",
    "nextNode": "b1-96"
  }
}
